Repository: vladfedchenko/photoselevel_app
Catalog: lib/l10n/intl_*.arb
Languages: ru, uk

source: Hello
ru: Привет
uk: Привіт

source: Login
ru: Логин
uk: Логін

source: Register
ru: Регистрация
uk: Регістрація

source: Server
ru: Сервер
uk: Сервер

source: Test connection
ru: Проверить соединение
uk: Перевірити з'єднання

source: Username
ru: Пользователь
uk: Користувач

source: Password
ru: Пароль
uk: Пароль

source: Connection status
ru: Состояние соединения
uk: Стан з'єднання

# serverEmpty
source: Server name empty.
ru: Имя сервера отсутствует.
uk: Ім'я сервера відсутнє.

# serverFormatWrong
source: Server name format is wrong. Server name must begin with http(s):// and not end with /.
ru: Ошибка формата имени сервера. Имя сервера должно начинаться с http(s):// и не заканчиваться на /.
uk: Помилка формату імені сервера. Ім'я сервера має починатися на http(s):// і не заканчуватися на /.

# serverConnectionFailed
source: Cannot establish connection with server {server}.
ru: Невозможно связаться с сервером {server}.
uk: Неможливо зв'язатися з сервером {server}.

# serverConnectionSuccessful
source: Connection with server {server} established.
ru: Связь с сервером {server} установлена.
uk: Зв'язок з сервером {server} встановлено.

# loginInfoEmpty
source: Both username and password must be entered.
ru: Имя пользователя или пароль отсутствуют.
uk: Ім'я користувача або пароль відсутні.

# timeoutExceeded
source: Timeout time exceeded while trying to connect to {server}.
ru: Время ожидания превышено при попытке связи с сервером {server}.
uk: Час очікування перевищено при спробі зв'язку з сервером {server}.

# unknownLoginError
source: Unknown error while trying to login.
ru: Неизвестная ошибка при попытке логина.
uk: Невідома помилка при спробі логіну.

source: No username provided.
ru: Имя пользователя не введено.
uk: Ім'я користувача не введено.

source: No password provided.
ru: Пароль отсутствует.
uk: Пароль не введений.

# userDontExist
source: User with entered username does not exist.
ru: Пользователь не существует.
uk: Користувач з введеним іменем не існує.

source: Wrong password.
ru: Неправильний пароль.
uk: Неправильний пароль.

# passwordInvalid
source: Must be at least 8 characters long.
ru: Должен иметь не менее 8 символов.
uk: Має мати не менше 8 символів.

source: User already exists.
ru: Пользователь с введённым именем уже существует.
uk: Користувач з введеним іменем вже існує.

# registeredSuccessfully
source: User {user} registered successfully.
ru: Пользователь {user} зарегистрирован успешно.
uk: Користувач {user} зареєстрований успішно.

# unknownRegisterError
source: Unknown error while trying to register.
ru: Неизвестная ошибка при попытке регистрации.
uk: Невідома помилка при спробі реєстрації.

# noStoragePermission
source: External storage access is required.
ru: Необходино предоставить доступ к хранилищу.
uk: Необхідно надати доступ до сховища.
